<details ><summary>plan for p-carinata-ci 2025-12-10 05:04:15 (UTC)</summary>
        <details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # proxmox_virtual_environment_vm.carinata_vm will be updated in-place
  ~ resource "proxmox_virtual_environment_vm" "carinata_vm" {
        id                                   = "120"
        name                                 = "p-carinata"
        # (31 unchanged attributes hidden)

      ~ initialization {
          ~ datastore_id = "local-zfs" -> (known after apply)
            # (1 unchanged attribute hidden)

          ~ dns {
              ~ servers = [
                  - "4.2.2.1",
                  - "4.2.2.2",
                  - "4.2.2.3",
                  - "4.2.2.4",
                ] -> (known after apply)
            }

          ~ ip_config {
              ~ ipv4 {
                  ~ address = "dhcp" -> (known after apply)
                  + gateway = (known after apply)
                }
            }

          ~ user_account {
              ~ keys     = [
                  - "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPDx+KV/SW4RGIeKA2FHU9S7bZgnJMy77N6lBeo2n8sJ",
                ] -> (known after apply)
              + password = (sensitive value)
              ~ username = "bri" -> (known after apply)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # terraform_data.initialization_map will be created
  + resource "terraform_data" "initialization_map" {
      + id     = (known after apply)
      + input  = {
          + datastore_id = "local-zfs"
          + dns          = {
              + servers = [
                  + "4.2.2.1",
                  + "4.2.2.2",
                  + "4.2.2.3",
                  + "4.2.2.4",
                ]
            }
          + ip_config    = {
              + ipv4 = {
                  + address = "dhcp"
                  + gateway = null
                }
            }
          + user_account = {
              + keys     = [
                  + "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIPDx+KV/SW4RGIeKA2FHU9S7bZgnJMy77N6lBeo2n8sJ",
                ]
              + password = (sensitive value)
              + username = "bri"
            }
        }
      + output = (known after apply)
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>

<details ><summary>Terraform plan validation check (p-carinata-ci)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                   RESOURCE                   |
|--------|----------------------------------------------|
| add    | `terraform_data.initialization_map`          |
| update | `proxmox_virtual_environment_vm.carinata_vm` |

</details>


<details ><summary>Instructions</summary>
  
▶️ To apply these changes, run the following command:

```bash
digger apply -p p-carinata-ci
```

⏩ To apply all changes in this PR:
```bash
digger apply
```

🚮 To unlock all projects in this PR:
```bash
digger unlock
```

</details>

</details>